# StructuralDisplayInHiddenViewsColumn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralDisplayInHiddenViewsColumn Property
ParameterTypeId Class See Also
---
"Display in Hidden Views"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralDisplayInHiddenViewsColumn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralDisplayInHiddenViewsColumn As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralDisplayInHiddenViewsColumn {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace